; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	instrument11 - instrument
	infrared5 - mode
	thermograph6 - mode
	thermograph4 - mode
	thermograph1 - mode
	infrared0 - mode
	thermograph3 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared5)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument2 infrared5)
	(supports instrument2 thermograph6)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph3)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
	(supports instrument4 thermograph6)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 infrared5)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 GroundStation5)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
	(supports instrument8 thermograph2)
	(supports instrument8 thermograph1)
	(supports instrument8 thermograph4)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 infrared5)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 GroundStation4)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star6)
	(supports instrument10 infrared5)
	(supports instrument10 thermograph6)
	(supports instrument10 thermograph3)
	(calibration_target instrument10 GroundStation3)
	(supports instrument11 infrared0)
	(calibration_target instrument11 GroundStation3)
	(on_board instrument10 satellite6)
	(on_board instrument11 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star10)
)
(:goal (and
	(pointing satellite0 Star10)
	(pointing satellite1 Star10)
	(pointing satellite2 Planet9)
	(pointing satellite4 Star10)
	(have_image Star6 thermograph3)
	(have_image Planet7 thermograph1)
	(have_image Planet7 thermograph2)
	(have_image Phenomenon8 thermograph4)
	(have_image Phenomenon8 thermograph6)
	(have_image Planet9 infrared0)
	(have_image Star10 thermograph1)
))

)

; plan
1. (turn_to satellite6 groundstation3 star10)
   deleted: (pointing satellite6 star10)
   added: (pointing satellite6 groundstation3)
   goals met: 0 of 11
2. (switch_on instrument10 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument10)
   goals met: 0 of 11
3. (calibrate satellite6 instrument10 groundstation3)
   added: (calibrated instrument10)
   goals met: 0 of 11
4. (turn_to satellite6 star6 groundstation3)
   deleted: (pointing satellite6 groundstation3)
   added: (pointing satellite6 star6)
   goals met: 0 of 11
5. (take_image satellite6 star6 instrument10 thermograph3)
   added: (have_image star6 thermograph3)
   goals met: 1 of 11
6. (turn_to satellite6 phenomenon8 star6)
   deleted: (pointing satellite6 star6)
   added: (pointing satellite6 phenomenon8)
   goals met: 1 of 11
7. (turn_to satellite5 groundstation1 star6)
   deleted: (pointing satellite5 star6)
   added: (pointing satellite5 groundstation1)
   goals met: 1 of 11
8. (turn_to satellite2 planet9 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet9)
   goals met: 2 of 11
9. (turn_to satellite1 star10 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star10)
   goals met: 3 of 11
10. (turn_to satellite0 groundstation2 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation2)
   goals met: 3 of 11
11. (take_image satellite6 phenomenon8 instrument10 thermograph6)
   added: (have_image phenomenon8 thermograph6)
   goals met: 4 of 11
12. (switch_on instrument8 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument8)
   goals met: 4 of 11
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 11
14. (calibrate satellite5 instrument8 groundstation1)
   added: (calibrated instrument8)
   goals met: 4 of 11
15. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 4 of 11
16. (turn_to satellite0 planet9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet9)
   goals met: 4 of 11
17. (take_image satellite0 planet9 instrument0 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 5 of 11
18. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 6 of 11
19. (turn_to satellite4 star10 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 star10)
   goals met: 7 of 11
20. (turn_to satellite5 phenomenon8 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 phenomenon8)
   goals met: 7 of 11
21. (take_image satellite5 phenomenon8 instrument8 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 8 of 11
22. (turn_to satellite5 planet7 phenomenon8)
   deleted: (pointing satellite5 phenomenon8)
   added: (pointing satellite5 planet7)
   goals met: 8 of 11
23. (take_image satellite5 planet7 instrument8 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 9 of 11
24. (take_image satellite5 planet7 instrument8 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 10 of 11
25. (turn_to satellite5 star10 planet7)
   deleted: (pointing satellite5 planet7)
   added: (pointing satellite5 star10)
   goals met: 10 of 11
26. (take_image satellite5 star10 instrument8 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 11 of 11
